TensorFlowFoam/misc/Other_models/ML_KO/ML_KO_Run/Setup/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
40747
(
1.48804e-05
7.68133e-11
1.04137e-10
1.48802e-05
1.80012e-05
9.52748e-11
1.14369e-10
1.8001e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
65
(
-1.48805e-05
-1.80013e-05
-2.17767e-05
-2.63439e-05
-3.18689e-05
-3.85527e-05
-4.66383e-05
-5.64197e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
113
(
3.21843e-05
3.49778e-05
3.80137e-05
4.13131e-05
4.48989e-05
4.8796e-05
5.30313e-05
5.76342e-05
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWallStartup
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
