TensorFlowFoam/misc/Other_models/ML_KO/ML_KO_Run/Setup/system/stressComponents
type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;

fields          (devReff);

